"""
Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), 
а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. 
Помогите Кате отгадать задуманные Петей числа.
"""

s, p = int(input('Enter number s: ')), int(input('Enter number p: '))
is_ans = False
for i in range(s):
    for j in range(p):
        if i * j == p and i + j == s:
            print(f'Answer: {i} and {j}')
            is_ans = True
        if is_ans:
            break
